---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.PanelScheduleView
source: html/c60ace95-5537-b326-80d7-6df87238ba18.htm
---
# PanelScheduleView Properties

Element id of Analysis Display Style associated with the view.